###############################匯入模組###############################
from tkinter import *

###############################建立視窗###############################
windows = Tk()
windows.title("My First GUI")


##############################定義函式###############################
def hi_fun():
    print("功德+1")


##############################建立按鈕###############################
btn1 = Button(windows, text="功德+1", command=hi_fun)
btn1.pack()
##############################建立標籤###############################
display = Label(windows, text="功德+1")
display.pack()

##############################運行應用程式##############################
windows.mainloop()
